load_testing/customized_test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 5
      arrivalRate: 5
      name: Warm up
    - duration: 20
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 20
      arrivalRate: 50
      name: Sustained load
  payload:
      # path is relative to the location of the test script
      path: "users.csv"
      fields:
        - "key"
        - "value"
        - "requestType"
      order: sequence

scenarios:
  - name: "Key value request"
    flow:
      - post:
          url: "/kv-request"
          json:
            key: "{{ key }}"
            value: "{{ value }}"
            requestType: "{{ requestType }}"