load_testing/customized_test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 200
      name: Phase 1
    - duration: 30
      arrivalRate: 200
      name: Phase 2
    - duration: 30
      arrivalRate: 200
      name: Phase 3
  http:
    # HTTP requests from all virtual users will be sent over these same connections.
    pool: 500
  payload:
      # path is relative to the location of the test script
      path: "users.csv"
      fields:
        - "key"
        - "value"
        - "requestType"
      order: sequence
      cast: false

scenarios:
  - name: "Key value request"
    flow:
      - post:
          url: "/kv-request"
          json:
            key: "{{ key }}"
            value: "{{ value }}"
            requestType: "{{ requestType }}"