load_testing/scenario_test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 5
      arrivalRate: 5
      name: Warm up
    - duration: 20
      arrivalRate: 5
      rampTo: 200
      name: Ramp up load
    - duration: 20
      arrivalRate: 200
      name: Sustained load
  variables:
    userId:
      - "1"
      - "1"
      - "1"
      - "1"
      - "1"
      - "1"
      - "1"
      - "1"
      - "2"
      - "2"
      - "2"
      - "3"


scenarios:
  - name: "Listing users"
    flow:
      - get:
          url: "/list-users"
    weight: 3
  - name: "Displaying user id 2"
    flow:
      - get:
          url: "/user-info/{{ userId }}"
    weight: 7