load_testing/scenario_test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 5
      arrivalRate: 5
      name: Warm up
    - duration: 20
      arrivalRate: 5
      rampTo: 200
      name: Ramp up load
    - duration: 20
      arrivalRate: 200
      name: Sustained load


scenarios:
  - name: "Listing users"
    flow:
      - get:
          url: "/list-users"
    weight: 8
  - name: "Displaying user id 2"
    flow:
      - get:
          url: "/user-info/2"
    weight: 2